cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/versions'

brew 'mas'
mas 'Xcode', id: 497799835
mas 'Slack', id: 803453959
mas '1Password', id: 443987910
mas 'LastPass', id: 926036361
mas 'TweetDeck', id: 485812721

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'caskroom/homebrew-fonts'
cask 'font-hack-nerd-font'
cask 'adobe-reader'
cask 'apache-directory-studio'
cask 'alfred'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'gimp'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'vagrant'
cask 'virtualbox'
cask 'skype'
cask 'iterm2'
cask 'dash'
cask 'google-cloud-sdk'
cask 'spectacle'
cask 'kindle'
cask 'visual-studio-code'

brew 'libarchive'
brew 'libevent'
brew 'libffi'
brew 'libelf'
brew 'libmagic'
brew 'libmaxminddb'
brew 'libmemcached'
brew 'libmpc'
brew 'libpgm'
brew 'libpng'
brew 'libressl'
brew 'libssh2'
brew 'libsodium'
brew 'libtasn1'
brew 'libtool'
brew 'libtiff'
brew 'libvpx'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'libzip'

brew 'binutils'
brew 'coreutils'
brew 'diffutils'
brew 'findutils'
brew 'gawk'
brew 'gnutls'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-time'
brew 'gnu-which', args: ['with-default-names']

brew 'ack'
brew 'xz'
brew 'pcre'
brew 'gettext'
brew 'autoconf'
brew 'icu4c'
brew 'openssl'
brew 'readline'
brew 'bison'
brew 'pkg-config'
brew 'freetype'
brew 'fontconfig'
brew 'pixman'
brew 'glib'
brew 'cairo'
brew 'gmp'
brew 'dos2unix'
brew 'dwarfutils'
brew 'jpeg'
brew 'figlet'
brew 'harfbuzz'
brew 'pango'
brew 'fontforge'
brew 'webp'
brew 'gd'
brew 'gdbm'
brew 'gflags'
brew 'glm'
brew 'glog'
brew 'graphviz'


brew 'pstree'


brew 'git'
brew 'mercurial'
brew 'ghq'
brew 'peco'
brew 'jq'
brew 'tmux'

cask 'mysql-client'
cask 'java'
brew 'groovy'
brew 'gauche'
brew 'go'
brew 'python'
brew 'lua'
brew 'luajit'
brew 'php'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pypy'
brew 'pypy3'
brew 'python3'
brew 'ruby'
brew 'ruby-build'
brew 'rbenv'
brew 'perl-build'
brew 'plenv'
brew 'cpanminus'
brew 'llvm', args: ['with-clang', 'with-lld', 'with-rtti']
brew 'nodebrew'

brew 'zsh'
brew 'cscope'
brew 'ctags'
brew 'gotags'
brew 'go-delve/delve/delve'
brew 'direnv'

brew 'sqlite'
brew 'wget'

brew 'packer'
brew 'terraform'
brew 'terraform_landscape'

brew 'imagemagick'
brew 'imap-uw'
brew 'jemalloc'
brew 'lz4'
brew 'lzo'
brew 'lzop'
brew 'mcrypt'
brew 'md5sha1sum'
brew 'sleuthkit'
brew 'osquery'
brew 'ossp-uuid'
brew 'popt'
brew 'rlwrap'
brew 'rpm2cpio'
brew 'rpm'
brew 'scons'
brew 'sl'
brew 'tbb'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tig'
brew 'tree'
brew 'unixodbc'
brew 'watch'
brew 'zlib'

tap 'neovim/neovim'
#tap 'rogual/neovim-dot-app'
brew 'neovim', args: ['HEAD']
cask 'intellij-idea'
cask 'vimr'

tap 'sanemat/font'
brew 'sanemat/font/ricty'

# qmk_firmware for ErgoDox
#tap osx-cross/avr
#teensy_loader_cli
#avr-libc
#dfu-programmer

# around docker
brew 'stern'

####################
# CommandLine Tools
###################
brew 'automake'
brew 'awscli'
brew 'amazon-ecs-cli'
brew 'bash'
brew 'bsdmake'
#brew 'ghc'
#brew 'cabal-install'
brew 'cmake'
brew 'curl', args: ['with-libressl']
brew 'wrk'
brew 'swagger-codegen'
brew 'lsd'
