# vim: set fdm=marker expandtab filetype=ruby:
cask_args appdir: '~/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/binary'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/nginx'
tap 'homebrew/php'
tap 'homebrew/versions'
tap 'sanemat/font'
tap 'supermomonga/splhack'
tap 'osx-cross/avr'

# Applications
brew 'homebrew/versions/jenkins-lts'
cask 'adobe-reader'
cask 'alfred'
cask 'apache-directory-studio'
cask 'atom'
cask 'consul'
  cask 'consul-cli'
  cask 'consul-template'
  cask 'consul-web-ui'
cask 'virtualbox'
cask 'dockertoolbox'
  brew 'docker-machine'
cask 'dropbox'
cask 'flash'
cask 'gimp'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'iterm2-beta'
cask 'java7'
cask 'macvim-kaoriya'
cask 'neovim/neovim/neovim'
cask 'skitch'
cask 'skype'
cask 'slack'
cask 'vagrant'
cask 'vlc'
# cask 'wireshark'
cask 'xtrafinder'
cask 'xccello'

# VCS, Shell
brew 'bash'
brew 'zsh'
brew 'subversion'
brew 'git'
brew 'mercurial'
brew 'gource'
brew 'tig'

# Lib
brew 'xz'
brew 'gettext'
brew 'libffi'
brew 'glib'
brew 'libpng'
brew 'libtool'
brew 'pcre'
brew 'icu4c'
brew 'beecrypt'
brew 'cpp-netlib'
brew 'openssl'
brew 'readline'
brew 'bison'
brew 'binutils'
brew 'pkg-config'
brew 'freetype'
brew 'fontconfig'
brew 'pixman'
brew 'gmp'
brew 'coreutils'
brew 'autoconf'
brew 'automake'
brew 'asio'
brew 'cairo'
brew 'libressl'
brew 'libssh2'
brew 'curl', args: ['with-libressl']
brew 'libsodium'
brew 'norm'
brew 'libpgm'
brew 'jpeg'
brew 'libtiff'
brew 'libelf'
brew 'dwarfutils'
brew 'wxmac'
brew 'gdbm'
brew 'gobject-introspection'
  brew 'harfbuzz'
brew 'pango'
brew 'fontforge'
brew 'libvpx'
brew 'gd'
brew 'gflags'
brew 'glew'
brew 'glm'
brew 'glog'
brew 'sdl2'
brew 'webp'
brew 'sdl2_image'
brew 'imagemagick'
brew 'imap-uw'
brew 'libarchive'
brew 'libevent'
brew 'libmagic'
brew 'jemalloc'
brew 'oniguruma'
brew 'libmemcached'
brew 'libtasn1'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'libzip'
brew 'lz4'
brew 'lzo'
brew 'lzop'
brew 'mhash'
brew 'mcrypt'
brew 'md5sha1sum'
brew 'mdp'
brew 'neon'
brew 'nkf'
brew 'snappy'
brew 'thrift'
brew 'yara'
brew 'sleuthkit'
brew 'ossp-uuid'
brew 'popt'
brew 're2c'
brew 'reattach-to-user-namespace'
brew 'rlwrap'
brew 'rmtrash'
brew 'powerline'
brew 'tbb'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tidy-html5'
brew 'tree'
brew 'unixodbc'
brew 'watch'
brew 'wget'
brew 'homebrew/boneyard/rocket'
brew 'homebrew/dupes/zlib'
brew 'sanemat/font/ricty'
brew 'supermomonga/splhack/gettext-mk'
brew 'avr-libc'

# CLI tools
brew 'pstree'
brew 'tmux'
brew 'peco'
brew 'osquery'
brew 'sl'
brew 'ack'
brew 'awscli'
brew 'amazon-ecs-cli'
brew 's3cmd'
brew 'ctags'
  brew 'supermomonga/splhack/ctags-objc-ja', args: ['HEAD']
brew 'gotags'
brew 'dos2unix'
brew 'figlet'
brew 'gawk'
brew 'gist'
brew 'gnu-sed'
brew 'jq'
brew 'supermomonga/splhack/cmigemo-mk', args: ['HEAD']

# Build / Benchmark tools
brew 'packer'
brew 'bsdmake'
brew 'cmake'
brew 'cscope'
brew 'rpm'
  brew 'rpm2cpio'
brew 'terraform'
brew 'wrk'

# Programming Languages
brew 'llvm', args: ['with-clang', 'with-rtti', 'with-lld']
brew 'cabal-install'
brew 'cpanminus'
brew 'erlang'
brew 'python'
brew 'gauche'
brew 'groovy'
brew 'lua'
brew 'luajit'
brew 'homebrew/boneyard/luarocks'
brew 'perl-build'
brew 'plenv'
brew 'pyenv-virtualenv'
brew 'ruby'
brew 'rbenv'
brew 'ruby-build'
brew 'pyenv'
brew 'pypy'
brew 'pypy3'
brew 'python3'
brew 'ocaml'
brew 'nodebrew'
cask 'java'
brew 'go'
brew 'boost'
brew 'ghc'
brew 'homebrew/php/php70'
brew 'homebrew/php/php70-mcrypt'
brew 'homebrew/php/php70-opcache'
brew 'homebrew/php/php70-tidy'

# Database
brew 'sqlite'
brew 'berkeley-db'
brew 'zeromq'
  brew 'czmq'
brew 'memcached'
brew 'mysql'
  brew 'mysql-connector-c++'
brew 'rocksdb'

# HTTP Server
brew 'nginx'
  brew 'homebrew/nginx/ngx-devel-kit'
  brew 'homebrew/nginx/lua-nginx-module'
brew 'homebrew/nginx/openresty'
