# vim: set ft=config expandtab:
cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask'

brew 'mas'
mas 'Xcode', id: 497799835
mas 'Slack', id: 803453959
mas '1Password', id: 443987910
mas 'LastPass', id: 926036361
mas 'TweetDeck', id: 485812721

tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'sanemat/font'
tap 'universal-ctags/universal-ctags'
tap 'k1low/tap'
tap 'knqyf263/utern'
tap 'aws/tap'

cask 'adobe-acrobat-reader'
# needs root
#cask "adoptopenjdk8"
cask 'alfred'
cask 'franz'
cask 'dropbox'
cask 'firefox'
#cask 'gimp'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'vivaldi'
#cask 'vagrant'
#cask 'virtualbox'
cask 'iterm2'
cask 'dash'
cask 'google-cloud-sdk'
# now, migrating to rectangle
#cask 'spectacle'
cask 'rectangle'
cask 'kindle'
cask 'visual-studio-code'
# now, migrating to jetbrains-toolbox
#cask 'intellij-idea'
cask 'jetbrains-toolbox'
cask 'gifcapture'
cask 'krisp'

#cask 'font-hack-nerd-font'
#cask 'font-hack-nerd-font-mono'
brew 'sanemat/font/ricty'

brew 'libarchive'
brew 'libevent'
brew 'libffi'
brew 'libelf'
brew 'libmagic'
brew 'libmaxminddb'
brew 'libmemcached'
brew 'libmpc'
brew 'libpgm'
brew 'libpng'
brew 'libressl'
brew 'libssh2'
brew 'libsodium'
brew 'libtasn1'
brew 'libtool'
brew 'libtiff'
brew 'libvpx'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'libzip'

brew 'binutils'
brew 'coreutils'
brew 'diffutils'
brew 'docutils'
brew 'findutils'
brew 'make'
brew 'gawk'
brew 'gcc'
brew 'gnutls'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-time'
brew 'gnu-which'
brew 'telnet'

#brew 'vim'
brew 'macvim'

brew 'rust'
# Powerful 'ps' https://github.com/dalance/procs
brew 'procs'
# Powerful 'cat' https://github.com/sharkdp/bat
brew 'bat'
# Powerful 'find' https://github.com/sharkdp/fd
brew 'fd'
# Powerful 'grep' https://github.com/BurntSushi/ripgrep
brew 'ripgrep'

brew 'ack'
brew 'xz'
brew 'pcre'
brew 'gettext'
brew 'autoconf'
brew 'icu4c'
brew 'openssl'
brew 'readline'
brew 'bison'
brew 'pkg-config'
brew 'freetype'
brew 'fontconfig'
brew 'pixman'
brew 'glib'
brew 'cairo'
brew 'gmp'
brew 'dos2unix'
brew 'dwarfutils'
brew 'jpeg'
brew 'figlet'
brew 'harfbuzz'
brew 'pango'
brew 'fontforge'
brew 'webp'
brew 'gd'
brew 'gdbm'
brew 'gflags'
brew 'glm'
brew 'glog'
brew 'graphviz'

brew 'pstree'

brew 'git'
brew 'github/gh/gh'
brew 'ghq'
brew 'hub'
# github actions runner on local
brew 'act'
#brew 'lab'
brew 'peco'
brew 'jq'
brew 'yq'
brew 'tmux'

brew 'mysql-client'
brew 'go'
brew 'php'
brew 'python'
brew 'pypy'
brew 'pyenv'
brew 'ruby-build'
brew 'rbenv'
# self-installed
# git clone git://github.com/tokuhirom/Perl-Build.git ~/.plenv/plugins/perl-build/
#brew 'perl-build'
brew 'plenv'
brew 'cpanminus'
brew 'llvm'
brew 'nodebrew'
brew 'deno'
#brew 'erlang@21'

brew 'zsh'
brew 'cscope'
#brew 'ctags'
brew 'universal-ctags'
brew 'gotags'
brew 'direnv'

brew 'sqlite'
brew 'wget'

brew 'packer'
brew 'tfenv'
brew 'terraform_landscape'

brew 'imagemagick'
brew 'imap-uw'
brew 'jemalloc'
brew 'lz4'
brew 'lzo'
brew 'lzop'
#brew 'md5sha1sum'
brew 'sleuthkit'
brew 'ossp-uuid'
brew 'popt'
brew 'rlwrap'
brew 'rpm'
brew 'scons'
brew 'tbb'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tig'
brew 'tree'
brew 'unixodbc'
brew 'watch'
brew 'zlib'

# qmk_firmware for ErgoDox
#tap osx-cross/avr
#teensy_loader_cli
#avr-libc
cask 'homebrew/cask-drivers/zsa-wally'
#dfu-programmer

# around docker
###########
# Container
###########
cask 'docker'
brew 'docker-compose'
brew 'stern'

#####
# AWS
#####
brew 'awscli'
brew 'aws/tap/copilot-cli'
brew 'knqyf263/utern/utern'
cask 'session-manager-plugin'
brew 'amazon-ecs-cli'

####################
# CommandLine Tools
###################
brew 'automake'
brew 'bash'
brew 'bsdmake'
#brew 'ghc'
#brew 'cabal-install'
brew 'cmake'
brew 'curl'
brew 'wrk'
brew 'lsd'
